describe("orderSheet service 테스트", () => {
  // mutation
  describe("DB에 주문서 생성하기", () => {
    it("상품과 수량정보를 바탕으로 주문서를 생성한다", () => {});
  });

  describe("도서 산간 정보 수정하기", () => {
    it("", () => {});
  });

  describe("해당 주문서에 선택된 쿠폰을 저장하기", () => {
    it("", () => {});
  });

  // calculation
  describe("주문서에 대한 금액 요약 정보 요청하기", () => {
    it("", () => {});
  });

  describe("해당 주문에 대해서 사용가능한 쿠폰 코드 요청하기", () => {
    it("", () => {});
  });

  describe("해당 주문서에서 선택된 쿠폰을 적용했을 때 할인 금액 요청하기", () => {
    it("", () => {});
  });
});
